app/Controllers/Api/Article.php

SELECT *
FROM `authors`
WHERE `authors`.`id` = '7'
---
    public function index()
    {
        $articles = $this->model->findAll();
        $authorModel = new AuthorModel();

        foreach ($articles as &$article) {
            $author = $authorModel->find($article['author_id']);

INSERT INTO `authors` (`name`, `created_at`, `updated_at`) VALUES ('Jelgava', '2025-07-12 20:31:30', '2025-07-12 20:31:30')
INSERT INTO `articles` (`date`, `title`, `summary`, `link`, `author_id`, `created_at`, `updated_at`) VALUES ('2025-07-08', 'Par Spānijas kailgliemežu izplatības ierobežošanu', '', 'https://www.jelgava.lv/jaunumi/par-spanijas-kailgl', 31, '2025-07-12 20:31:30', '2025-07-12 20:31:30')
---
    public function create()
    {
        // LABOTS: getJson(true) atgriež JSON datus kā masīvu.
        // Frontend (api/index.js) sūta JSON priekš createArticle.
        $input = $this->request->getJSON(true);
        $authorModel = new AuthorModel();

        $authorId = $input['authorId'];
        if (strpos($authorId, 'new-author-') === 0) {
            $newAuthorName = substr($authorId, strlen('new-author-'));
            $authorData = ['name' => $newAuthorName];
            if ($authorModel->insert($authorData)) {
                $authorId = $authorModel->insertID();
            } else {
                return $this->failServerError('Neizdevās izveidot jaunu autoru rakstam.');
            }
        }
        $input['authorId'] = $authorId;

        $data = [
            'date'      => $input['date'],
            'title'     => $input['title'],
            'summary'   => $input['summary'] ?? null,
            'link'      => $input['link'] ?? null,
            'author_id' => (int)$input['authorId']
        ];

        if ($this->model->insert($data)) {
            $newArticleId = $this->model->insertID();