app/Controllers/Api/Video.php

SELECT *
FROM `authors`
WHERE `authors`.`id` = '1'
SELECT *
FROM `themes`
WHERE `themes`.`id` = 109
---
    public function index()
    {
        $videos = $this->model->findAll();
        $authorModel = new AuthorModel();
        $themeModel = new ThemeModel();

        foreach ($videos as &$video) {
            $author = $authorModel->find($video['author_id']);
            $video['authorName'] = $author ? $author['name'] : 'Nezināms autors';
            $theme = $themeModel->find(109);